zsh-utilities-configure.org
#+TITLE:  Zsh Utilities Configuration
#+AUTHOR: Xavier Garrido
#+DATE:   2013-02-08
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:zsh-utilities.org][Zsh Utilities]].

* Zsh Utilities - Configuration
This file sets different environment variables given the hostname of the
machine. Using org-mode's folding, each item contains the configuration for a
given hostname. The function name must be =__configure_$(hostname)= in such a
way it should be easy to add its own configuration.

** Main configuration function
#+BEGIN_SRC sh
  function __configure_machine ()
  {
      __pkgtools__at_function_enter __configure_machine

      # This must be done by default
      export HOSTNAME=$(hostname)

      case "$HOSTNAME" in
          garrido-laptop|pc-91089)
              __configure_laptop
              ;;
          lx3.lal.in2p3.fr|nemo*.lal.in2p3.fr)
              __configure_lal_machines
              ;;
          ccige*|ccage*)
              __configure_lyon_machines
              ;;
          *)
              type __configure_$(hostname) | grep -q "shell function" > /dev/null 2>&1
              if [ $? -eq 0 ]; then
                  __configure_$(hostname)
              else
                  pkgtools__msg_warning "No configuration for machine '$(hostname)' has been found ! Use default one"
                  __configure_default
              fi
              ;;
      esac

      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC

** Default configuration
#+BEGIN_SRC sh
  function __configure_default ()
  {
      __pkgtools__at_function_enter __configure_default
      umask 022
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** Laptop/server configuration
#+BEGIN_SRC sh
  function __configure_laptop ()
  {
      __pkgtools__at_function_enter __configure_laptop
      # Load RVM function (Ruby manager)
      #[[ -s "$HOME/.rvm/scripts/rvm" ]] && . "$HOME/.rvm/scripts/rvm"

      # Use 256 colors terminal
      pkgtools__reset_variable TERM xterm-256color

      # Homemade latex style
      pkgtools__reset_variable TEXMFHOME ${HOME}/.config/texmf
      pkgtools__reset_variable TEXMFOUTPUT /tmp

      # Load Go Programming Language
      pkgtools__reset_variable GOPATH ${HOME}/Development/go
      pkgtools__add_path_to_PATH ${GOPATH}/bin

      # Adding also /usr/local/lib to LD_LIBRARY_PATH
      pkgtools__add_path_to_LD_LIBRARY_PATH /usr/local/lib

      # Adding utilities path
      pkgtools__add_path_to_PATH ${HOME}/.bin

      # Set HOST
      pkgtools__reset_variable HOST ${HOSTNAME}
      pkgtools__reset_variable WORKDIR ${HOME}/Workdir

      # Set EDITOR
      pkgtools__reset_variable EDITOR "emacsclient"

      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC

** LAL machines configuration
#+BEGIN_SRC sh
  function __configure_lal_machines ()
  {
      __pkgtools__at_function_enter __configure_lal_machines

      umask 022
      pkgtools__reset_variable WORKDIR /exp/nemo/garrido

      # Add TeXLive 2012
      pkgtools__add_path_to_PATH ${WORKDIR}/software/texlive/2012/bin/x86_64-linux
      pkgtools__unset_variable TEXMFCNF
      pkgtools__unset_variable TETEXDIR

      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
** Lyon machines configuration
#+BEGIN_SRC sh
  function __configure_lyon_machines ()
  {
      __pkgtools__at_function_enter __configure_lyon_machines
      pkgtools__reset_variable SCRATCH_DIR /sps/nemo/scratch/garrido
      source ${THRONG_DIR}/sw/config/SL6.4/nemo_basic_sw_setup-1.0.bash > /dev/null 2>&1
      do_nemo_basics_sw_setup_1 > /dev/null 2>&1
      __pkgtools__at_function_exit
      return 0
  }
#+END_SRC
