zsh-utilities-configure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Zsh Utilities Configuration</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css" />
               <link rel="stylesheet" href="css/org-pygments.css" />
               <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css" />
</head>
<body onload="randomLinkColor();displayTOC();"><div id="toc"></div>
<div id="preamble" class="status">
<a href="index.html"><i class="fa fa-home"></i></a><br/> <a href="https://github.com/xgarrido/zsh-utilities"><i class="fa fa-github"></i></a><br/>
</div>
<div id="content">
<h1 class="title">Zsh Utilities Configuration</h1>
<p>
This is part of the <a href="zsh-utilities.html">Zsh Utilities</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Zsh Utilities - Configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
This file sets different environment variables given the hostname of the
machine. Using org-mode's folding, each item contains the configuration for a
given hostname. The function name must be <code>__configure_$(hostname)</code> in such a
way it should be easy to add its own configuration.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Main configuration function</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__configure_machine</span> ()
{
    __pkgtools__at_function_enter __configure_machine

    <span class="org-comment-delimiter"># </span><span class="org-comment">This must be done by default</span>
    <span class="org-builtin">export</span> <span class="org-variable-name">HOSTNAME</span>=$(hostname)

    <span class="org-keyword">case</span> <span class="org-string">"$HOSTNAME"</span><span class="org-keyword"> in</span>
        garrido-laptop|pc-91089)
            __configure_laptop
            ;;
        lx3.lal.in2p3.fr|nemo*.lal.in2p3.fr)
            __configure_lal_machines
            ;;
        ccige*|ccage*)
            __configure_lyon_machines
            ;;
        *)
            <span class="org-builtin">type</span> __configure_$(hostname) | grep -q <span class="org-string">"shell function"</span> &gt; /dev/null 2&gt;&amp;1
            <span class="org-keyword">if</span> [ $<span class="org-variable-name">?</span> -eq 0 ]; <span class="org-keyword">then</span>
                __configure_$(hostname)
            <span class="org-keyword">else</span>
                pkgtools__msg_warning <span class="org-string">"No configuration for machine '$(hostname)' has been found ! Use default one"</span>
                __configure_default
            <span class="org-keyword">fi</span>
            ;;
    <span class="org-keyword">esac</span>

    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Default configuration</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__configure_default</span> ()
{
    __pkgtools__at_function_enter __configure_default
    <span class="org-builtin">umask</span> 022
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Laptop/server configuration</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__configure_laptop</span> ()
{
    __pkgtools__at_function_enter __configure_laptop

    <span class="org-comment-delimiter"># </span><span class="org-comment">Use 256 colors terminal</span>
    pkgtools__reset_variable TERM xterm-256color

    <span class="org-comment-delimiter"># </span><span class="org-comment">Homemade latex style</span>
    pkgtools__reset_variable TEXMFHOME ${<span class="org-variable-name">HOME</span>}/.config/texmf
    pkgtools__reset_variable TEXMFOUTPUT /tmp

    <span class="org-comment-delimiter"># </span><span class="org-comment">Load Go Programming Language</span>
    pkgtools__reset_variable GOPATH ${<span class="org-variable-name">HOME</span>}/Development/go
    pkgtools__add_path_to_PATH ${<span class="org-variable-name">GOPATH</span>}/bin

    <span class="org-comment-delimiter"># </span><span class="org-comment">Adding also /usr/local/lib to LD_LIBRARY_PATH</span>
    pkgtools__add_path_to_LD_LIBRARY_PATH /usr/local/lib

    <span class="org-comment-delimiter"># </span><span class="org-comment">Adding utilities path</span>
    pkgtools__add_path_to_PATH ${<span class="org-variable-name">HOME</span>}/.bin

    <span class="org-comment-delimiter"># </span><span class="org-comment">Set HOST</span>
    pkgtools__reset_variable HOST ${<span class="org-variable-name">HOSTNAME</span>}
    pkgtools__reset_variable WORKDIR ${<span class="org-variable-name">HOME</span>}/Workdir

    <span class="org-comment-delimiter"># </span><span class="org-comment">Set EDITOR</span>
    pkgtools__reset_variable EDITOR <span class="org-string">"emacsclient"</span>

    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">LAL machines configuration</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__configure_lal_machines</span> ()
{
    __pkgtools__at_function_enter __configure_lal_machines

    <span class="org-builtin">umask</span> 022
    pkgtools__reset_variable WORKDIR /exp/nemo/garrido

    <span class="org-comment-delimiter"># </span><span class="org-comment">Add TeXLive 2012</span>
    pkgtools__add_path_to_PATH ${<span class="org-variable-name">WORKDIR</span>}/software/texlive/2012/bin/x86_64-linux
    pkgtools__unset_variable TEXMFCNF
    pkgtools__unset_variable TETEXDIR

    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Lyon machines configuration</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">function</span> <span class="org-function-name">__configure_lyon_machines</span> ()
{
    __pkgtools__at_function_enter __configure_lyon_machines
    pkgtools__reset_variable SCRATCH_DIR /sps/nemo/scratch/garrido
    <span class="org-builtin">source</span> ${<span class="org-variable-name">THRONG_DIR</span>}/sw/config/SL6.4/nemo_basic_sw_setup-1.0.bash &gt; /dev/null 2&gt;&amp;1
    do_nemo_basics_sw_setup_1 &gt; /dev/null 2&gt;&amp;1
    __pkgtools__at_function_exit
    <span class="org-keyword">return</span> 0
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under <i class="fa fa-github-alt"></i> version control - commit <a href="https://github.com/xgarrido/zsh-utilities/commit/6511cb0e54545f0e8312a0dc6552a90678b5dea4">6511cb0</a> - 2014-05-01
</div>
</body>
</html>
